---
kind: other
id: Properties.T:Autodesk.Revit.DB.Steel.SteelElementProperties
source: html/29a6447f-e417-1536-f78e-020319ebb530.htm
---
# SteelElementProperties Properties

Identifies if the object is read-only or modifiable.